package Homework15_from_04_10_23;

public class TaskFrom15_10_23 {
    //Прочитать
    //1) Правило Де Моргана
    //Огастес де Морган первоначально заметил, что в классической пропозициональной логике
    // справедливы следующие соотношения:
        //не (a и b) = (не a) или (не b)
    //не (a или b) = (не a) и (не b)
    //Отрицание конъюнкции есть дизъюнкция отрицаний.
    //Отрицание дизъюнкции есть конъюнкция отрицаний.

    //2) Пул строк в джава
    //Пул строк – это набор строк хранящийся в Heap.
    String text = "Hello World";
    String text1 = "Hello World";

    //Сформулировать в одном-двух предложениях, о чем гласит
    // правило Де Моргана, и что такое пул строк в ответ на эту домашку
}
